In [1]:
import pandas as pd

In [2]:
s = pd.Series([2, -1, 3, 5])
s

0    2
1   -1
2    3
3    5
dtype: int64

In [3]:
import numpy as np
np.exp(s)

0      7.389056
1      0.367879
2     20.085537
3    148.413159
dtype: float64

In [4]:
s + [1000, 2000, 3000, 4000]

0    1002
1    1999
2    3003
3    4005
dtype: int64

In [5]:
s + 1000

0    1002
1     999
2    1003
3    1005
dtype: int64

In [6]:
s < 0

0    False
1     True
2    False
3    False
dtype: bool

In [7]:
s2 = pd.Series([68, 83, 112, 68], index=['alice', 'bob', 'charles', 'darwin'])
s2

alice       68
bob         83
charles    112
darwin      68
dtype: int64

In [8]:
s2['bob']

np.int64(83)

In [9]:
s2.loc['bob']

np.int64(83)

In [10]:
s2.iloc[1]

np.int64(83)

In [11]:
s2.iloc[1:3]

bob         83
charles    112
dtype: int64

In [12]:
surprise = pd.Series([1000, 1001, 1002, 1003])
surprise

0    1000
1    1001
2    1002
3    1003
dtype: int64

In [13]:
surprise_slice = surprise[2:]
surprise_slice

2    1002
3    1003
dtype: int64

In [14]:
try:
    surprise_slice[0]
except KeyError as e:
    print("Key error:", e)

Key error: 0

In [15]:
surprise_slice.iloc[0]

np.int64(1002)

In [16]:
weights = {"alice": 68, "bob": 83, "colin": 86, "darwin": 68}
s3 = pd.Series(weights)
s3

alice     68
bob       83
colin     86
darwin    68
dtype: int64

In [17]:
s4 = pd.Series(weights, index = ["colin", 'alice'])
s4

colin    86
alice    68
dtype: int64

In [18]:
print(s2.keys())
print(s3.keys())

s2 + s3

Index(['alice', 'bob', 'charles', 'darwin'], dtype='object')
Index(['alice', 'bob', 'colin', 'darwin'], dtype='object')

alice      136.0
bob        166.0
charles      NaN
colin        NaN
darwin     136.0
dtype: float64

In [19]:
s5 = pd.Series([1000, 1000, 1000, 1000])
print("s2 =", s2.values)
print("s5 =", s5.values)

s2 + s5

s2 = [ 68  83 112  68]
s5 = [1000 1000 1000 1000]

alice     NaN
bob       NaN
charles   NaN
darwin    NaN
0         NaN
1         NaN
2         NaN
3         NaN
dtype: float64